# CannotChangeSubwall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotChangeSubwall Property
BuiltInFailures..::..WallFailures Class See Also
---
Changing the type of a subwall is not allowed. Edit the stacked wall type instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotChangeSubwall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotChangeSubwall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotChangeSubwall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace